import {
  Calendar,
  Drama,
  Flame,
  Grid,
  Heart,
  MessageCircle,
  Monitor,
  Popcorn,
  Smartphone,
  Star,
  Tablet,
  Users,
} from 'lucide-react';

export const categories = [
  { label: 'Жахи', movies: ['horror1', 'horror2', 'horror3', 'horror4'] },
  {
    label: 'Пригодницькі',
    movies: ['adventure1', 'adventure2', 'adventure3', 'adventure4'],
  },
  { label: 'Драма', movies: ['drama1', 'drama2', 'drama3', 'drama4'] },
  {
    label: 'Фентезі',
    movies: ['fantasy1', 'fantasy2', 'fantasy3', 'fantasy4'],
  },
];

export const features = [
  {
    title: 'Ваш особистий кінозал',
    text: `У MovieNest ви отримуєте власний простір, де можна зберігати улюблені фільми, серіали та мультфільми. 
      Створюйте списки перегляду, щоб завжди мати під рукою те, що хочете подивитися сьогодні ввечері чи відкласти на потім.
      Ми подбали про зручність — у будь-який момент ви зможете повернутися до збережених стрічок і насолодитися переглядом без довгих пошуків.`,
    image: '/movies/feature1.png',
    icons: [Heart, Calendar, Grid],
  },
  {
    title: 'Фільми, що надихають',
    text: `Кіно — це не лише розвага, а й справжнє джерело емоцій та натхнення. 
    У нашій колекції ви знайдете як культові стрічки, що змінили історію кінематографа, так і найсвіжіші прем’єри. 
    Від романтичних комедій до напружених трилерів, від фантастики до документалістики — кожен жанр відкриє для вас нові історії, які залишають слід у пам’яті.`,
    image: '/movies/feature2.png',
    icons: [Star, Flame, Drama],
    reverse: true,
  },
  {
    title: 'Разом цікавіше',
    text: `Фільми об’єднують людей — друзів, родину, колег. 
    Дивіться кіно разом і діліться враженнями у зручних обговореннях. 
    Наш сервіс допоможе вам відкрити нові ідеї для вечорів у компанії та покаже, що обрали інші глядачі. 
    Адже кожна історія стає ще яскравішою, коли ви переживаєте її не наодинці, а разом з близькими.`,
    image: '/movies/feature3.png',
    icons: [Users, MessageCircle, Popcorn],
  },
  {
    title: 'Дивіться де завгодно',
    text: `MovieNest доступний із будь-якого пристрою — комп’ютера, планшета чи смартфона. 
    Ви можете почати перегляд на одному екрані та продовжити на іншому, не втрачаючи прогресу. 
    Це зручно вдома, у дорозі чи навіть у подорожі. Кіно завжди з вами, незалежно від того, де ви перебуваєте.`,
    image: '/movies/feature4.png',
    icons: [Monitor, Tablet, Smartphone],
    reverse: true,
  },
];
